# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import random

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv('cars1.csv')
cars2 = pd.read_csv('cars2.csv')

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [3]:
cars1 = pd.read_csv('cars1.csv')
_ = cars1.columns.str.contains('Unnamed:')
# Solution 1
cars1 = cars1.loc[:,~_] # 741 µs ± 79.1 µs

cars1 = pd.read_csv('cars1.csv')
_ = cars1.columns.str.contains('Unnamed:')
# Solution 2
cars1.drop(columns=cars1.columns[_]) # 995 µs ± 17.1 µs

cars1 = pd.read_csv('cars1.csv')
_ = cars1.columns.str.contains('Unnamed:')
# Solution 3
for c in cars1.columns[_]: del cars1[c] # 1.560 µs

### Step 5. What is the number of observations in each dataset?

In [9]:
cars1.shape, cars2.shape

((198, 9), (200, 9))

In [10]:
cars1.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320

In [11]:
cars2.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,33.0,4,91,53,1795,17.4,76,3,honda civic
1,20.0,6,225,100,3651,17.7,76,1,dodge aspen se

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [21]:
# Solution 1
cars = pd.concat([cars1, cars2])
# Solution 2
cars = cars1.append(cars2)

cars.reset_index(inplace=True)
cars.head()

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [18]:
ser = pd.Series(np.random.randint(15000, 73000, cars.shape[0]), index=cars.index)

### Step 8. Add the column owners to cars

In [20]:
cars['owners'] = ser
cars.head(2)

,index,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,64450
1,1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,63775